[
  {
    "title": "Oracle SCM Professional (Principal Level)",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Oracle SCM Professional to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "4-6 yrs of experience in Oracle SCM modules and supply chain processes, with a strong track record in techno-functional roles.",
    "description": [
      "Serve as a techno-functional expert across Oracle SCM modules, including Inventory, Order Management, Purchasing, Manufacturing, Planning, and Warehouse Management.",
      "Provide advanced troubleshooting and resolution for complex Oracle SCM issues, coordinating with IT and Oracle support.",
      "Lead configuration and customization efforts to align Oracle SCM with evolving business needs.",
      "Design and implement enhancements and new functionalities within Oracle SCM, including Oracle Process Manufacturing (OPM) if applicable."
    ],
    "requirements": [
      "Bachelor's degree in Computer Science, supply chain management, Business Administration, Information Technology, or a related field.",
      "Experience with Oracle E-Business Suite (EBS) or Oracle Cloud SCM.",
      "Proficiency in Oracle reporting tools, SQL, and data analysis.",
      "Experience with Oracle Process Manufacturing (OPM) is highly desirable."
    ]
  },
  {
    "title": "Local Purchasing Specialist",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Local Purchasing Specialist to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "1-2 years of experience in purchasing or procurement, preferably within the pharmaceutical or manufacturing industry.",
    "description": [
      "Manage the procurement process for local purchases, ensuring compliance with company policies and procedures.",
      "Source and evaluate suppliers, negotiate contracts, and maintain relationships with vendors to achieve favorable terms.",
      "Collaborate with cross-functional teams to identify purchasing needs and develop procurement strategies.",
      "Analyze purchasing data and market trends to recommend cost-saving initiatives and efficient purchasing practices."
    ],
    "requirements": [
      "Bachelor's degree in Business Administration, Supply Chain Management is preferable.",
      "Strong negotiation and communication skills.",
      "Proficient in MS Office applications and experience with procurement software is an advantage."
    ]
  },
  {
    "title": "Internal Communication Specialist",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "People Operations",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Internal Communication Specialist to join our dynamic team. The ideal candidate will play a key role in ensuring smooth and engaging communication across all departments, helping build a cohesive and informed company culture.",
    "experience": "0-1 year of experience in a communication, HR, or administrative role (internships count!).",
    "description": [
      "Develop and execute internal communication strategies and campaigns.",
      "Create engaging content for newsletters, announcements, and internal platforms.",
      "Coordinate with departments to ensure alignment of internal messaging.",
      "Support in planning internal events and employee engagement initiatives.",
      "Monitor feedback and continuously improve communication channels."
    ],
    "requirements": [
      "Bachelor's degree in Mass Communication, Business Administration, or a related field.",
      "Excellent writing and verbal communication skills (English & Arabic).",
      "Strong organizational skills and attention to detail.",
      "Creativity and ability to engage employees through innovative messaging."
    ]
  },
  {
    "title": "Senior Labor Engagement Specialist",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "People Operations",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are looking for a Senior Labor Engagement Specialist who is passionate about building a productive and positive relationship with our workforce. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "1-2 years of relevant experience in labor relations or employee engagement.",
    "description": [
      "Support and lead initiatives related to labor relations and employee engagement.",
      "Act as a point of contact between management and employees to address concerns and resolve conflicts.",
      "Ensure compliance with labor laws, union requirements, and internal policies.",
      "Participate in labor negotiations and assist with grievance handling.",
      "Analyze engagement data and recommend actions to improve workplace culture."
    ],
    "requirements": [
      "Bachelor’s degree in Law, Business Administration, Human Resources, or a related field.",
      "Strong understanding of Egyptian labor law and regulatory requirements.",
      "Excellent interpersonal, negotiation, and conflict-resolution skills.",
      "Ability to work independently and manage sensitive employee matters confidentially."
    ]
  },
  {
    "title": "Trade Marketing Manager",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Egypt Cluster",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Trade Marketing Manager to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "3+ years of experience in trade marketing or brand activation within FMCG or pharmaceutical sectors.",
    "description": [
      "Plan and implement trade marketing initiatives across pharmacy channels to drive sell-out.",
      "Customize national marketing campaigns to meet the needs of specific trade channels.",
      "Work closely with sales teams to ensure alignment on promotions, new launches, and merchandising standards.",
      "Analyze sales and market data to identify growth opportunities and optimize ROI on trade activities.",
      "Lead execution of campaigns, displays, and visibility programs"
    ],
    "requirements": [
      "Bachelor's Degree in Business Administration, Marketing, or any relevant field (a pharmacy degree is a plus).",
      "Experience with modern trade, key accounts, or pharmacy channel activation is a plus.",
      "Knowledge of market dynamics in Egypt’s pharmaceutical retail scene is a plus.",
      "Proficiency in MS Office Programmes, familiarity with dashboards, and strong analytical, communication, and problem-solving skills are considered a plus, along with the ability to travel and handle multiple projects with ownership and drive."
    ]
  },
  {
    "title": "Oracle Development Professional (Principal Level)",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Oracle Development Professional to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "4 -7 years of experience as an Oracle Technical, including EBS R12.2+ environments.",
    "description": [
      "Develop and maintain Oracle Forms, Reports, PL/SQL packages, and APEX applications.",
      "Customize and extend Oracle EBS modules to meet business requirements.",
      "Collaborate with functional teams to gather and analyze requirements & Ensure code quality, performance, and adherence to development standards.",
      "Participate in system upgrades, patching, and performance tuning."
    ],
    "requirements": [
      "Bachelor’s degree in computer science, Information Systems, or related field.",
      "Strong command of Oracle Forms, Reports, PL/SQL, and SQL.",
      "Experience with Oracle EBS modules (e.g., Financials, SCM, HRMS). & APEX development lifecycle and deployment.",
      "Understanding of software development methodologies (Agile/Scrum is a plus)."
    ]
  },
  {
    "title": "Motion Graphics Designer",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Egypt Cluster",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Motion Graphics Designer to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "2 years of experience as a Motion Graphics Designer.",
    "description": [
      "Creating visually stunning motion graphics and 2D and 3D animations for various digital media platforms including social media, websites, and video content.",
      "Editing video footage and adding effects/elements to enhance motion graphics.",
      "Collaborating with the commercial team, including graphic designers, stakeholder, and content creators, to conceptualize and storyboard motion graphic projects that align with brand guidelines and project objectives.",
      "Strong understanding of animation principles, typography, color theory, and visual composition."
    ],
    "requirements": [
      "Proven experience as a Motion Graphics Designer, with a strong portfolio demonstrating expertise in animation and visual effects.",
      "Strong knowledge of Adobe Creative Cloud (Adobe After Effects - Adobe Premiere - Adobe Photoshop).",
      "Good knowledge of any 3D programs.",
      "Strong team player who can collaborate effectively with different stakeholders."
    ]
  },
  {
    "title": "R&D Researcher",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "R&D Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented fresh graduate R&D Researcher - Class of 2025 to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "talented fresh graduate",
    "description": [
      "Conduct research and development activities for pharmaceutical products, including formulation, analytical methods, and process development.",
      "Design and execute experiments to improve existing formulations and develop new products.",
      "Collaborate with cross-functional teams, including Regulatory Affairs, Quality Control, and Manufacturing, to ensure smooth product development.",
      "Document and analyze experimental data to provide insights and recommendations.",
      "Ensure compliance with regulatory guidelines, quality standards, and Good Laboratory Practice (GLP).",
      "Keep up-to-date with industry trends, scientific advancements, and innovative technologies.",
      "Support the preparation of technical reports, regulatory submissions, and scientific publications."
    ],
    "requirements": [
      "Bachelor's degree in Pharmacy, Pharmaceutical Sciences, or a related field.",
      "Passionate about research and development.",
      "Hands-on training with laboratory equipment and software related to pharmaceutical R&D is preferably.",
      "Excellent problem-solving, analytical, and critical-thinking skills.",
      "Strong communication and teamwork abilities to work effectively across departments.",
      "Proficiency in English (spoken and written)."
    ]
  },
  {
    "title": "Digital Marketing Executive",
    "work_mode": "On-site",
    "work_type": "",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Digital Marketing Executive to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "3-5 years of experience in digital marketing, preferably within the pharmaceutical or healthcare sectors.",
    "description": [
      "Develop and implement digital marketing strategies across various channels, including social media, email, and websites.",
      "Create engaging content for digital platforms to enhance brand awareness and drive customer engagement.",
      "Analyze and report on the performance of digital campaigns, optimizing for improved results.",
      "Collaborate with cross-functional teams to ensure alignment of marketing strategies with business objectives.",
      "Stay up-to-date with the latest digital trends and technologies to enhance our marketing efforts."
    ],
    "requirements": [
      "Bachelor's degree in Marketing, Business, or a related field.",
      "Strong knowledge of digital marketing tools and platforms (e.g., Google Analytics, social media advertising).",
      "Excellent communication and writing skills.",
      "Ability to analyze data and derive actionable insights."
    ]
  },
  {
    "title": "Regulatory Affairs Specialist",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Europe Cluster",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a detail-oriented and driven Regulatory Affairs Specialist to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "1-3 years of experience in regulatory affairs within the pharmaceutical or healthcare industry.",
    "description": [
      "Prepare and submit regulatory applications and documentation to the appropriate authorities within Europe.",
      "Review and assess product labeling, promotional materials, and technical documentation for compliance with regulatory requirements.",
      "Maintain knowledge of current and evolving regulations in the pharmaceutical sector, particularly within the European Union.",
      "Act as the liaison between the company and regulatory authorities, facilitating communication and addressing inquiries or issues.",
      "Support the development of regulatory strategies for new product registrations and life cycle management."
    ],
    "requirements": [
      "Bachelor's degree in Pharmacy, Life Sciences, or a related field.",
      "Knowledge of EU regulatory frameworks, guidelines, and procedures.",
      "Excellent communication skills, both written and verbal, in English; proficiency in additional European languages is a plus.",
      "Highly organized with the ability to manage multiple projects and deadlines effectively."
    ]
  },
  {
    "title": "Production Specialist",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Production Specialist to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "0-2 years of experience in production or manufacturing environments.",
    "description": [
      "Monitor and manage the complete production process, including material weighing, processing, compression, filling, blistering, and packaging.",
      "Lead and coordinate the work of production staff, ensuring adherence to GMP, GDP, and safety protocols.",
      "Prepare and clean production equipment according to established procedures prior to operations.",
      "Evaluate production conditions and promptly address any operational issues.",
      "Maintain accurate production records and documentation in compliance with company standards."
    ],
    "requirements": [
      "Bachelor's degree in Pharmacy.",
      "Strong organizational and leadership skills, with an emphasis on teamwork.",
      "Proficient in English (spoken and written).",
      "Proficient in Microsoft Office applications."
    ]
  },
  {
    "title": "Digital Marketing Specialist - HCP Platform",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Digital Marketing Specialist – HCP Platform to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "1-2 years of experience in digital marketing, preferably within the healthcare or pharmaceutical sectors.",
    "description": [
      "Develop and execute digital marketing strategies tailored to healthcare professionals (HCPs).",
      "Create and manage content for HCP-focused platforms, ensuring relevance and engagement.",
      "Analyze digital marketing metrics and campaign performance to drive data-driven decisions.",
      "Collaborate with cross-functional teams, including medical and sales, to ensure alignment with brand and communication strategies.",
      "Stay updated on digital marketing trends and best practices within the pharmaceutical industry."
    ],
    "requirements": [
      "Bachelor's degree in Marketing, Communications, or related field.",
      "Strong understanding of digital marketing tools and analytics.",
      "Excellent communication and project management skills.",
      "Fluency in English is required."
    ]
  },
  {
    "title": "Quality Director",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "As a Quality Director, you will be responsible for providing strategic direction and leadership to our entire Quality function. Reporting directly to the CEO.",
    "experience": "20+ years in pharmaceutical QA/QC, with 10+ years in senior leadership.",
    "description": [
      "Define and execute a quality strategy aligned with global standards (cGMP, FDA, EMA, WHO, SFDA).",
      "Ensure full compliance across all manufacturing sites, CMOs, and API suppliers.",
      "Lead QA, QC, and Microbiology to ensure efficient batch release and reliable market supply.",
      "Oversee accurate testing, batch release, and stability programs.",
      "Manage preparation and response for regulatory inspections (FDA, EU QP, WHO, etc.).",
      "Liaise with regulatory agencies during inspections and audits.",
      "Act as the subject matter expert (SME) for quality audits, inspections, and certifications.",
      "Lead risk identification, mitigation, and quality improvement initiatives.",
      "Collaborate with senior leadership and other departments to resolve quality issues.",
      "Support product development teams to ensure quality in new product development."
    ],
    "requirements": [
      "Bachelor's in pharmacy (mandatory)",
      "Master's or certification in Quality Management (preferred)",
      "Expertise in global cGMP, QMS, and regulatory compliance (FDA, EMA, SFDA, WHO)",
      "Proven track record in branded generics and international regulatory frameworks",
      "Solid performance in driving quality improvements",
      "Experience managing cross-functional teams",
      "Strong expertise in quality management systems, risk management, CAPA, and root cause analysis"
    ]
  },
  {
    "title": "Production Specialist",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Production Specialist to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "0-2 years of experience in a similar position.",
    "description": [
      "Follow up on the entire production process: starting from raw material weighing, through processing, tablet compression, capsule filling, sachet filling, blistering, packaging, and ending with final delivery to the warehouse.",
      "Supervise production technicians, assign daily tasks, and ensure compliance with GMP, GDP, and safety procedures.",
      "Ensure proper cleaning and setup of machines as per work instructions before starting production.",
      "Monitor production conditions (e.g., temperature, humidity, machine logbooks) and report any malfunctions or deviations.",
      "Ensure accurate and complete batch documentation in real time.",
      "Report and follow up on machine issues or infrastructure problems."
    ],
    "requirements": [
      "Bachelor's degree in Pharmaceutical Sciences.",
      "Excellent communication and interpersonal skills.",
      "Result-oriented personality with team working ability & resilience.",
      "Fluency in spoken & written English is required.",
      "Excellent knowledge of Microsoft Office Professional (Word, Excel, PowerPoint, MS Outlook)."
    ]
  },
  {
    "title": "Medical Advisor",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Global Medical Affairs",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Medical Advisor to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "Minimum of 5 years of experience in the pharmaceutical industry or a related field, with 2-3 experience in medical affairs. Cardiovascular, Diabetes or Immunology related experience is a plus.",
    "description": [
      "Serve as a scientific and medical expert for the company's therapeutic area(s) and respective products, providing clinical and scientific support across various functions.",
      "Build and maintain strong relationships with Key Opinion Leaders (KOLs), healthcare professionals, and other external stakeholders.",
      "Provide expertise in clinical trials/studies design, protocol development, and data interpretation to ensure alignment with the company's medical strategy.",
      "Monitor the respective research projects.",
      "Lead and contribute to the development of training materials for internal stakeholders, such as sales, marketing, and medical teams."
    ],
    "requirements": [
      "Medical degree, PharmD or relevant scientific background in life sciences.",
      "Post-graduate qualification or board certification in a relevant therapeutic area is a plus.",
      "Experience in managing and leading medical projects, research projects, and medical communications.",
      "Good level of Medical Writing basics and related publications process.",
      "Good level of Knowledge of GCP, research types, global processes and national regulations."
    ]
  },
  {
    "title": "Medical Representative (Limitless Naturals)",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Limitless Naturals",
    "company_info": "Launched with a startup mindset focused on innovation and empowered by EVA Pharma's Team capabilities, Limitless Naturals has quickly transformed into one of the fastest-growing companies in the food supplement industry within just a few years. Initially driven by a commitment to harness cutting-edge research and development, Limitless' innovative and diverse range of supplements has set new standards of quality and efficacy in the market. This rapid growth has propelled the company beyond its home country; Egypt, leading to significant global expansion demonstrating its ability to adapt to diverse consumer needs while maintaining its core values of innovation and excellence.",
    "job_summary": "We are seeking a passionate and talented Medical Representative to join our dynamic team from any region in Egypt. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "2025 graduates. Previous experience or relevant internships are a plus but not required.",
    "description": [
      "Increases sales and market share of Products (according to the Line) through effective territory management and sales execution.",
      "Develops and implements plans (e.g., territory, account and call) that include goals, action plans, time frames and resources.",
      "Establishes strong relationships with a broad base of health care constituents (e.g. physicians, private hospitals, pharmacies, teaching hospitals, targeted community hospitals, and community offices, etc) through one-on-one sales presentations, group discussions and medical meeting exhibits.",
      "Develops and implements creative strategies in key accounts and key opinion leaders (KOLs)."
    ],
    "requirements": [
      "Bachelor's degree in a relevant field (e.g., Pharmacy)",
      "Strong communication and interpersonal skills.",
      "Self-motivated with a drive to succeed in a competitive sales environment."
    ]
  },
  {
    "title": "Medical Representative",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Egypt Cluster",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Medical Representative from any region in Egypt to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "2023 - 2025 graduates. Previous experience or relevant internships are a plus.",
    "description": [
      "Promotes assigned pharmaceutical products and drives sales growth by effectively managing the territory and executing strategic plans to target physicians in both institutional and private sectors.",
      "Develops and implements plans (e.g., territory, account and call) that include goals, action plans, time frames and resources.",
      "Establishes strong relationships with a broad base of health care constituents (e.g. physicians, private hospitals, pharmacies, teaching hospitals, targeted community hospitals, and community offices, etc) through one-on-one sales presentations, group discussions and medical meeting exhibits.",
      "Develops and implements creative strategies in key accounts and key opinion leaders (KOLs)."
    ],
    "requirements": [
      "Bachelor's degree in a relevant field (e.g., Pharmacy, Veterinary medicine).",
      "Strong communication, negotiation skills, problem-solving skills, and interpersonal skills.",
      "A self-motivated professional with passion for healthcare and drive to improve patient care in a competitive sales environment."
    ]
  },
  {
    "title": "Quality Assurance IPC Professional",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "6th of october, Al Jizah, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Quality Assurance IPC Professional to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "5-8 years Of experience",
    "description": [
      "Assure the acceptance of the environmental conditions (Temp. %RH, ΔP) compliance with GMP requirements for all production areas and according to its classification, and the calibration and verification reports of all measuring devices.",
      "Assure GMP & system implementation of regulations and instructions related to the application of procedures on daily basis and providing related reports accordingly, with verifying the batch records and logbooks completeness and guarantee of all data recorded.",
      "Review, modify (if needed) and follow up QC sampling Plan of intermediates and finished products for each batch to obtain representative samples required.",
      "Review the executed manufacturing batch records for completeness, correctness, compliance of in-process control results with specification and Execute CAPA of 'unusual incidents or non-Conformity'."
    ],
    "requirements": [
      "Bachelor Degree in Pharmaceutical Sciences or Science",
      "cGMP and Prevention of Cross Contamination",
      "cGMP Documentation (Sop)",
      "CAPA & Change Control Management System"
    ]
  },
  {
    "title": "Group Product Manager",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Egypt Cluster",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Group Product Manager to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "10+ Years of progressive marketing experience.",
    "description": [
      "Develop and execute strategic plans for a portfolio of pharmaceutical products.",
      "Lead, coach, and support a team of product managers to ensure high performance.",
      "Oversee product launches and go-to-market strategies in coordination with cross-functional teams.",
      "Monitor market trends and product performance to drive continuous improvement and growth."
    ],
    "requirements": [
      "Bachelor's degree in Pharmaceutical Sciences.",
      "People management experience is a must.",
      "Marketing certification is preferred.",
      "Experience in Bone, Pain or Immunology is preferred."
    ]
  },
  {
    "title": "Regulatory Affairs Specialist",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Al Qahirah, Egypt",
    "department": "Regulatory Affairs",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Regulatory Affairs Specialist to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "From 0 to 2 years of experience in Regulatory Affairs in international Markets",
    "description": [
      "Regulatory Compliance - Ensure all products meet international regulations, serving as the primary regulatory contact for our international hubs.",
      "Product Registration - Prepare, submit, and manage dossiers for new drugs, renewals, and variations, guiding approvals from start to finish.",
      "Compliance Monitoring - Stay ahead of evolving regulations, advising internal teams on critical updates to maintain full compliance.",
      "Labeling & Packaging Review - Ensure all pharma labeling, packaging, and promotional materials adhere to regulatory standards.",
      "Cross-Functional Collaboration - Partner with R&D, QA, Manufacturing, and Marketing to embed regulatory requirements at every stage."
    ],
    "requirements": [
      "Bachelor's degree in Pharmaceutical Sciences.",
      "Fluent in English (written & verbal) - essential for global collaboration",
      "Detail-oriented, proactive, and eager to grow in a dynamic regulatory landscape"
    ]
  },
  {
    "title": "PHI Field Market Access",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Egypt Cluster",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented PHI Field Market Access to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "2-3 years of experience in PHI Access, and/or Field market access, Self-Insured, and Private Hospitals in Egypt.",
    "description": [
      "Develop and implement strategic access plans for EVA Pharma products with private healthcare insurance providers.",
      "Build and maintain key relationships with decision-makers to ensure patient access and drive product performance.",
      "Define business strategies, optimize resource allocation, and analyze market dynamics within the health insurance sector.",
      "Build strong connections with PHI decision-makers to ensure understanding of product value and manage stakeholders supporting patient access to EVA Pharma portfolio."
    ],
    "requirements": [
      "Bachelor's Degree in Pharmaceutical Sciences.",
      "Fluency in spoken & written English is required.",
      "Experience with value-based projects and health economics."
    ]
  },
  {
    "title": "Scientific Sales Representative (Poultry Line)",
    "work_mode": "On-site",
    "work_type": "",
    "location": "Dakahlia, Ad Daqahliyah, Egypt",
    "department": "Animal Health",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Scientific Sales Representative-Poultry Line to join our dynamic team. The ideal candidate will contribute to our mission of enhancing animal health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "0-2 years of sales or promotion experience (animal health/pharma preferred).",
    "description": [
      "Sales & Promotion: Achieve sales targets by promoting EVA Pharma Animal Health products to veterinary clinics, pharmacies, farms, and feed mills.",
      "Scientific Detailing: Conduct effective visits and engage in seminars and workshops to boost product awareness and credibility.",
      "Customer Relationships: Build strong, trust-based relationships with clients and key stakeholders.",
      "Market Insights: Report on competitor activities, market trends, and customer needs.",
      "Team Collaboration: Attend internal trainings and coordinate with cross-functional teams."
    ],
    "requirements": [
      "Bachelor's degree in Veterinary Medicine. (Poultry)",
      "Strong communication and scientific presentation skills.",
      "Valid driver's license and readiness to travel.",
      "Proficiency in Microsoft Office; CRM experience is a plus."
    ]
  },
  {
    "title": "Scientific Sales Representative (Ruminant Line)",
    "work_mode": "On-site",
    "work_type": "",
    "location": "Dakahlia, Ad Daqahliyah, Egypt",
    "department": "Animal Health",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Scientific Sales Representative-Ruminant Line to join our dynamic team. The ideal candidate will contribute to our mission of enhancing animal health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "0-2 years of sales or promotion experience (animal health/pharma preferred).",
    "description": [
      "Sales & Promotion: Achieve sales targets by promoting EVA Pharma Animal Health products to veterinary clinics, pharmacies, farms, and feed mills.",
      "Scientific Detailing: Conduct effective visits and engage in seminars and workshops to boost product awareness and credibility.",
      "Customer Relationships: Build strong, trust-based relationships with clients and key stakeholders.",
      "Market Insights: Report on competitor activities, market trends, and customer needs.",
      "Team Collaboration: Attend internal trainings and coordinate with cross-functional teams."
    ],
    "requirements": [
      "Bachelor's degree in Veterinary Medicine. (Ruminant)",
      "Strong communication and scientific presentation skills.",
      "Valid driver's license and readiness to travel.",
      "Proficiency in Microsoft Office; CRM experience is a plus."
    ]
  },
  {
    "title": "Senior Electrical Engineer",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Senior Electrical Engineer to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "2-4 years of experience in electrical engineering, preferably within the pharmaceutical or biotechnology industry.",
    "description": [
      "Design, develop, and implement electrical systems and components for pharmaceutical manufacturing equipment, ensuring compliance with industry standards and regulations.",
      "Collaborate with cross-functional teams to ensure projects are aligned with organizational goals and timelines.",
      "Prepare and manage project documentation, including technical specifications, drawings, and maintenance manuals.",
      "Lead and participate in commissioning and qualification activities for electrical systems and equipment.",
      "Develop and execute preventive maintenance plans for electrical systems, ensuring compliance with Good Manufacturing Practices (GMP) and regulatory requirements."
    ],
    "requirements": [
      "Bachelor's degree in Electrical Engineering or a related field.",
      "Excellent analytical and problem-solving skills.",
      "Strong communication skills with the ability to work effectively in a collaborative team environment."
    ]
  },
  {
    "title": "PHI Key Account Manager",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Egypt Cluster",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented PHI Key Account Manager to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "Minimum 2–4 years of experience in pharmaceutical sales, market access, or key account management.",
    "description": [
      "Account Strategy: Develop plans and build relationships with key private healthcare stakeholders.",
      "Access & Reimbursement: Negotiate product listings and pricing, ensuring product inclusion in hospital protocols.",
      "Business Growth: Identify new opportunities and support new product launches, monitor market trends, competitor activities, and policy changes affecting private healthcare access.",
      "Collaboration: Partner with internal teams (marketing, medical, regulatory, supply chain). Collaborate with the Market Access and Field market access teams to present value propositions and health economic data.",
      "Performance Tracking: Monitor KPIs and report on account performance. Provide feedback from the field to inform brand planning and market access strategies."
    ],
    "requirements": [
      "Bachelor's degree in pharmacy, Medicine, Business, or related field (MBA is a plus).",
      "Strong negotiation, communication, and stakeholder management skills.",
      "Fluency in English is Required."
    ]
  },
  {
    "title": "Microbiology Specialist",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a knowledgeable and dedicated Microbiology Specialist to join our team. The ideal candidate will play a crucial role in maintaining the quality and safety of our products through rigorous microbiological analysis and quality assurance.",
    "experience": "0-2 years of experience in microbiology within the pharmaceutical, biotechnology, or related industries.",
    "description": [
      "Conduct microbiological testing on raw materials, in-process samples, and finished products in accordance with relevant regulatory standards.",
      "Develop, validate, and implement microbiological testing methods, ensuring compliance with GMP and quality assurance protocols.",
      "Monitor environmental conditions within production areas and laboratories, ensuring compliance with microbiological standards.",
      "Investigate and resolve microbiological product complaints, deviations, and sterility failures, providing comprehensive reports and recommendations.",
      "Support the development and execution of continuous improvement initiatives related to microbiological practices."
    ],
    "requirements": [
      "Master's or Bachelor's degree in Science, Pharmacy, or a related field.",
      "Excellent communication and interpersonal skills."
    ]
  },
  {
    "title": "Quality Control Specialist",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Quality Control Specialist to join our dynamic team. The ideal candidate will play a crucial role in maintaining the highest quality standards in our products and processes.",
    "experience": "0-2 years of experience in quality control or quality assurance within the pharmaceutical or related industry.",
    "description": [
      "Investigate deviations, non-conformities, and out-of-specification results to identify root causes and implement corrective actions.",
      "Collaborate with production and quality assurance teams to ensure timely resolution of quality issues and enhance product quality.",
      "Assist in stability studies and evaluate shelf-life data for finished products.",
      "Monitor compliance with Good Manufacturing Practices (GMP) and quality standards throughout the production process.",
      "Participate in internal and external audits, providing necessary documentation and support."
    ],
    "requirements": [
      "Bachelor's degree in Science, Biochemistry, or a related field.",
      "Ability to work effectively in a team environment and adapt to changing priorities."
    ]
  },
  {
    "title": "IT Help Desk Engineer",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented IT Help Desk Engineer to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "Proven experience as a Service Desk Engineer, IT Support Technician, or similar role.",
    "description": [
      "Diagnosing and troubleshooting hardware, software, and network issues and providing remote and on-site support for desktops, laptops, printers, and mobile devices.",
      "Escalate unresolved issues to higher-level support teams as necessary and maintain accurate records of issues and resolutions in the ticketing system.",
      "Assist in onboarding and offboarding processes, including account setup and hardware provisioning and ensure compliance with IT policies and procedures.",
      "Participate in IT projects and initiatives as needed."
    ],
    "requirements": [
      "Strong knowledge of Windows and/or macOS operating systems.",
      "Familiarity with Active Directory, Office 365, and remote desktop tools.",
      "Basic understanding of networking concepts (TCP/IP, DNS, DHCP).",
      "Customer-oriented mindset with a focus on delivering high-quality support."
    ]
  },
  {
    "title": "Quality Assurance Specialist",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Quality Assurance Specialist to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "0-2 years of relevant experience in a pharmaceutical QA environment.",
    "description": [
      "Monitor environmental conditions (temperature, humidity, pressure differentials) and ensure they comply with GMP requirements across production and warehouse areas.",
      "Participate in raw material dispensing and verify specifications and calculations as per SOPs.",
      "Oversee manufacturing and packaging operations to ensure adherence to GMP, SOPs, and data integrity requirements.",
      "Review batch records and logbooks for completeness, accuracy, and compliance with GDP (Good Documentation Practice).",
      "Record and report deviations, non-conformities, and incidents. Participate in root cause investigations and track corrective and preventive actions (CAPA)."
    ],
    "requirements": [
      "Bachelor's degree in Pharmaceutical Sciences or Pharmacy.",
      "Knowledge of cGMP and GDP principles.",
      "Understanding of CAPA, change control, and quality documentation systems.",
      "Familiarity with ISO 9001 and safety programs.",
      "Awareness of validation principles and basic statistical concepts."
    ]
  },
  {
    "title": "CRM Project Manager",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented CRM Project Manager to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "Proven experience as a Project Manager, with specific experience managing CRM implementation or upgrading projects within a digital context.",
    "description": [
      "Define the scope, objectives, and deliverables of CRM projects within the digital landscape, aligning with our overall digital strategy and business goals.",
      "Develop detailed project plans, timelines, and resource allocation strategies specifically for digital CRM initiatives.",
      "Manage user training and adoption efforts for the CRM platform among digital team members and relevant end-users.",
      "Ensure comprehensive documentation of digital CRM project plans, requirements, configurations, and training materials.",
      "Monitor and evaluate the effectiveness of digital CRM implementations, analyzing key metrics and identifying areas for optimization in our digital engagement strategies."
    ],
    "requirements": [
      "Bachelor's degree in engineering or computer science, business administration, Information Technology, Digital Marketing, or a related field.",
      "Strong knowledge in project management tools (e.g., MS Project, Jira, MS Azure).",
      "Experience with at least one major CRM platform.",
      "Strong organizational and time management skills, particularly in managing multiple digital projects simultaneously.",
      "Understanding of the pharmaceutical industry and its regulatory environment in Egypt is a plus."
    ]
  },
  {
    "title": "Quality Assurance Specialist",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Quality Assurance Specialist to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "0-2 years of experience in a similar position.",
    "description": [
      "Check and evaluate critical tests and checks to assure product quality.",
      "Track and trend results, investigations, nonconformance, deviations, change control and complaints.",
      "Observe the conditions of online and in-process for compliance.",
      "Review batch record for completeness, correctness and compliance of IPC."
    ],
    "requirements": [
      "Bachelor's degree in Pharmaceutical Sciences.",
      "Excellent communication and interpersonal skills.",
      "Result-oriented personality with team working ability & resilience.",
      "Problem-Solving Skills, Details-oriented.",
      "Fluency in spoken & written English is required.",
      "Excellent knowledge of Microsoft Office Professional (Word, Excel, PowerPoint, MS Outlook).",
      "Able to work rotational shifts."
    ]
  },
  {
    "title": "Labor engagement Senior Business Partner",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Giza, El Omraniya, Egypt",
    "department": "People Operations",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Labor Engagement Senior Business Partner to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "6+ years of experience in personnel or HR operations.",
    "description": [],
    "requirements": [
      "Bachelor's degree in business administration, Human Resources, or a related field.",
      "Strong knowledge of labor laws and social insurance regulations.",
      "Excellent attention to detail and organizational skills.",
      "Proficiency in HRIS and Microsoft Office (Excel, Word).",
      "Strong communication and problem-solving skills."
    ]
  },
  {
    "title": "UX Designer",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented UI-UX Designer to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "1-3 years of hands-on UX design experience",
    "description": [
      "Turn business and user needs into actionable design solutions",
      "Conduct usability testing, turning insights into meaningful improvements",
      "Collaborating with cross-functional teams (product, development, business)"
    ],
    "requirements": [
      "Strong portfolio demonstrating UX thinking and tangible impact",
      "Excellent communication and collaboration skills",
      "Experience in healthcare or complex systems is a plus"
    ]
  },
  {
    "title": "Senior Financial Analyst - Supply Chain",
    "work_mode": "Hybrid",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Finance",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Senior Financial Analyst - Supply Chain to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "Minimum of 3+ years of experience within FMCG-Pharmaceutical companies, experience with ERP system especially Oracle is a plus.",
    "description": [
      "Procurement Finance: Work closely with purchasing and supply chain department to optimize prices and payment terms, providing financial analysis to compare supplying options while meeting company's DPO target.",
      "Working Capital Optimization: Conduct financial analysis with operations team to improve Working Capital ratios and determine optimal inventory levels, collaborating with Planning team on direct material stocks and ordering system.",
      "Supply Chain Governance: Ensure implementation of financial controls across supply chain, suggesting improvements to enhance governance.",
      "Budgeting & Forecasting: Contribute to annual budgeting and forecasting by providing estimates for all elements of supply Chain Cost.",
      "Inventory monitoring: Monitor RM & FG inventory across markets/clusters, working with operations to reduce/eliminate write-off costs and waste."
    ],
    "requirements": [
      "Bachelor's Degree of Commerce/Business Administration, CMA is a plus.",
      "Excellent command in English Language.",
      "Very good communication skills."
    ]
  },
  {
    "title": "Cost Accountant",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Finance",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Cost Accountant to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "1-3 years of experience in cost accounting or financial analysis, preferably in the manufacturing or pharmaceutical industry.",
    "description": [
      "Prepare and analyze cost reports related to manufacturing processes, ensuring accurate tracking of costs and expenses.",
      "Conduct product cost analysis, including bill of materials, labor costs, and overhead rates to support pricing decisions.",
      "Monitor and manage inventory levels, conducting regular audits to ensure accuracy in valuation.",
      "Assist in budgeting and forecasting processes by providing insights on cost trends and variances.",
      "Collaborate with cross-functional teams to identify areas for cost reduction and process improvement.",
      "Ensure compliance with financial regulations and internal controls while maintaining accurate financial records."
    ],
    "requirements": [
      "Bachelor's degree in Accounting, Finance, or a related field.",
      "Proficiency in accounting software and ERP systems; experience with Oracle is a plus.",
      "Fluency in English is required."
    ]
  },
  {
    "title": "Senior Accountant / GCC (Egypt Based)",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Finance",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Senior Accountant/GCC (Egypt Based) to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "2-5 years of experience in Manufacturing industries.",
    "description": [
      "Debt recovery: Skilled in identifying overdue accounts, following up with customers, and implementing effective strategies to recover outstanding payments, ensuring timely collection and minimizing bad debt.",
      "Negotiation with Customers: Experience in negotiating repayment plans and finding alternative payment solutions with customers.",
      "Reconciliation: Proficient in reconciling accounts by comparing and matching financial records, ensuring all discrepancies are identified and resolved, and maintaining accurate and up-to-date financial statements.",
      "Aging analysis: Experienced in creating detailed aging reports to track overdue accounts, categorizing outstanding balances by due dates, and providing management with clear, actionable insights to support decision-making and improve collection efforts."
    ],
    "requirements": [
      "Bachelor's Degree in Accounting or Finance (English Section).",
      "Must have Experience in Using ERP System - Preferably (Oracle).",
      "Very Good in English, both verbal and written.",
      "IFRS Diploma is a plus."
    ]
  },
  {
    "title": "Senior Maintenance Engineer",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Operations Business Division",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Maintenance Engineer to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "0-2 years of experience in a similar position.",
    "description": [
      "Implement approved preventive maintenance action plans for production machinery.",
      "Perform Factory Acceptance Testing (FAT) and Site Acceptance Testing (SAT) for new machines to validate performance.",
      "Assist in training technicians on the operation and maintenance of production machines.",
      "Follow up on the regular maintenance schedule for production machines to ensure compliance."
    ],
    "requirements": [
      "Bachelor's degree in engineering, Major: Electrical Engineering, Mechatronics, or Mechanical Power.",
      "Excellent communication and interpersonal skills.",
      "Result-oriented personality with team working ability & resilience.",
      "Fluency in spoken & written English is required.",
      "Excellent knowledge of Microsoft Office Professional (Word, Excel, PowerPoint, MS Outlook)."
    ]
  },
  {
    "title": "Senior Administration Assistant",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Regulatory Affairs",
    "company_info": "Join EVA Pharma, a leading pharmaceutical company dedicated to empowering the fight for Health and well-being as a fundamental human right. Recognized and certified as a best place to work, we are committed to fostering a supportive and innovative environment for our team members.",
    "job_summary": "We are seeking a passionate and talented Senior Administration Assistant to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "experience": "At least 2 years of experience",
    "description": [
      "Manage and organize schedules and appointments.",
      "Handle correspondence, emails, and phone calls.",
      "Maintain filing systems and records.",
      "Prepare reports and documents as needed.",
      "Coordinate meetings and take minutes.",
      "Assist in office management and organization procedures."
    ],
    "requirements": [
      "Good command of English (written and spoken)",
      "Presentable with good communication skills"
    ]
  },
  {
    "title": "Senior R&D Researcher - Biologics & mRNA - R&D - EVA Pharma - October - Egypt",
    "work_mode": "On-site",
    "work_type": "Full time",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "",
    "company_info": "Join EVA Pharma: A Global Leader in Healthcare Innovation! At EVA Pharma, we fight for health and well-being as a fundamental human right, using innovation to address unmet medical needs worldwide. Led by a diverse and experienced team, EVA Pharma operates across branded generics, vaccines, OTC products, food supplements, herbal medicines, and veterinary products, and has a presence in over 40 countries. As one of the fastest-growing pharmaceutical manufacturers in the MENA region, EVA Pharma is transforming the future of healthcare.",
    "job_summary": "We are seeking a highly skilled and motivated Senior R&D Researcher - Biologics & mRNA to join our team",
    "experience": "At least 2 years of Proven hands-on experience in Bioprocess research for the aim of developing biotherapeutics",
    "description": [
      "Lead experimental design and execution of research projects focused on biologics and mRNA therapeutics, aligning with EVA Pharma's strategic R&D objectives.",
      "Develop and optimize bioprocesses for the production of therapeutic proteins, mRNA vaccines, and other biologics using mammalian and microbial expression systems.",
      "Conduct analytical method development and validation for product characterization, including identity, purity, potency, and stability testing.",
      "Drive scale-up activities from lab-scale to pilot-scale, including tangential flow filtration (TFF), chromatography, and formulation processes.",
      "Collaborate cross-functionally with upstream, downstream, and analytical development teams to ensure seamless project progression and knowledge transfer.",
      "Stay abreast of the latest advancements in biologics, mRNA platforms, and regulatory guidelines to integrate innovation into EVA Biologics' pipeline.",
      "Prepare technical reports, SOPs, and documentation in accordance with regulatory requirements and internal quality standards.",
      "Mentor junior researchers and contribute to a culture of scientific excellence, collaboration, and continuous improvement within the team.",
      "Present research findings to internal stakeholders, and contribute to scientific publications, patent filings, or conference presentations as appropriate.",
      "Participate in troubleshooting and problem-solving efforts to address technical challenges encountered during R&D activities."
    ],
    "requirements": [
      "Bachelor's degree in pharmaceutical sciences, molecular biology, biotechnology, biochemistry, immunology, or a closely related field.",
      "Familiarity with mRNA technology and different vaccine platforms; protein subunit, and viral vectors a plus.",
      "Expertise in mammalian cell culture (development, banking, growth optimization), transfection, cryopreservation, and ideally microbial fermentation.",
      "The ability to design, execute, analyze experiments, and understand statistical design (DoE) and multivariate data analysis.",
      "A strong background in developing, qualifying, and validating analytical methods for biologics characterization (purity, identity, potency) following ICH guidelines.",
      "Experience in biomolecule purification such as protein / mRNA / plasmid DNA (crossflow/tangential flow filtration, column chromatography skids), viral clearance studies, and ideally polymer/LNP formulation and scale-up.",
      "Excellent analytical and critical thinking skills.",
      "Strong written and verbal communication skills in English, with the ability to present complex scientific data effectively.",
      "A results-oriented mindset and the ability to thrive in a team environment.",
      "Resilience, a strong work ethic, and the ability to multitask effectively.",
      "An open mind and a commitment to a collaborative and transparent work culture."
    ]
  }
]